Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: No camera, no pics.. Please allow [APPNAME] to access your camera in phone settings.
cy: Dim camera, dim lluniau.. Rhowch ganiatâd i [APPNAME] gael mynediad at eich camera yng ngosodiadau eich ffôn.

source: No Results
cy: Dim canlyniadau

source: No results to show.
cy: Dim canlyniadau i'w dangos.

source: No Cards
cy: Dim Cardiau

source: No cards available to swap in
cy: Dim cardiau ar gael i'w cyfnewid yn

source: No cards left to swap in
cy: Dim cardiau ar ôl i'w cyfnewid yn

source: No Requests
cy: Dim Ceisiadau

source: No code? Request a new one %s
cy: Dim cod? Gwnewch gais am un newydd %s

source: No forecast summary available.
cy: Dim crynodeb o'r rhagolwg ar gael.

source: No matches :/
cy: Dim cyfatebiad :/

source: Facebook not connected
cy: Dim cyswllt â Facebook

source: No Connection
cy: Dim cysylltiad

source: No internet connection
cy: Dim cysylltiad â'r rhyngrwyd

source: No Contacts
cy: Dim Cysylltiadau

source: No users nearby
cy: Dim defnyddwyr gerllaw

source: No new users from your contacts. Please check later!
cy: Dim defnyddwyr newydd o'ch cysylltiadau. Edrychwch eto yn ddiweddarach!

source: No users connected
cy: Dim defnyddwyr wedi'u cysylltu

source: Insufficient Funds!
cy: Dim digon o ddarnau arian!

source: Out of Space
cy: Dim digon o le

source: No events recorded in this period
cy: Dim digwyddiadau wedi'u cofnodi yn y cyfnod hwn

source: No, thanks
cy: Dim diolch

source: No Wifi Available
cy: Dim diwifr ar gael

source: No users' hotspots available
cy: Dim dolenni clicio defnyddwyr ar gael

source: No contact methods are available.
cy: Dim dulliau cysylltu ar gael.

source: No date
cy: Dim dyddiad

source: No Due Date
cy: Dim dyddiad cwblhau yn erbyn

source: No saved designs
cy: Dim dyluniadau wedi'u cadw

source: No email
cy: Dim e-bost

source: NO ITEMS TO LEARN
cy: DIM EITEMAU I'W DYSGU

source: Not yet
cy: Dim eto

source: No Favorites
cy: Dim Ffefrynnau

source: No image sources are available.
cy: Dim ffynonellau lluniau ar gael.

source: No evening guests
cy: Dim gwesteion gyda'r nos

source: No day guests
cy: Dim gwesteion yn y dydd

source: No History…
cy: Dim Hanes…

source: No Filter
cy: Dim hidlydd

source: NO ADS
cy: DIM HYSBYSEBION

source: No-ads forever
cy: Dim hysbysebion am byth

source: No ads!
cy: Dim hysbysebion!

source: No notifications yet
cy: Dim hysbysiadau eto

source: No Location
cy: Dim Lleoliad

source: No mems
cy: Dim mems

source: Purchases could not be restored.
cy: Dim modd adfer pryniannau.

source: Non billable
cy: Dim modd bilio

source: Unable to validate receipt.
cy: Dim modd dilysu'r dderbynneb.

source: No access to contacts
cy: Dim mynediad at gysylltiadau

source: No Photo Access
cy: Dim mynediad i'r llun

source: No Messages.
cy: Dim Negeseuon.

source: No changes
cy: Dim newidiadau

source: No Reminder
cy: Dim nodyn atgoffa

source: No Location Reminder
cy: Dim nodyn atgoffa am leoliad

source: No delay
cy: Dim oedi

source: Just me
cy: Dim ond fi

source: Only me
cy: Dim ond fi

source: Only from people I follow
cy: Dim ond o bobl rwy'n eu dilyn

source: You will only have to accept once
cy: Dim ond unwaith bydd yn rhaid ichi dderbyn

source: No posts, yet.
cy: Dim postiadau, eto.

source: No problems, [APPNAME] has you covered.
cy: Dim problem, mae [APPNAME] yno i chi.

source: No time pressure
cy: Dim pwysau amser

source: No More Cards
cy: Dim Rhagor o Gardiau

source: No List
cy: Dim Rhestr

source: No Network
cy: Dim Rhwydwaith

source: No Alerts
cy: Dim rhybuddion

source: No Internet
cy: Dim rhyngrwyd

source: No job sites.
cy: Dim safleoedd gweithio.

source: No positions.
cy: Dim swyddi.

source: No advanced functions
cy: Dim swyddogaethau uwch

source: no roaming charges
cy: dim taliadau crwydro

source: No current subscription
cy: Dim tanysgrifiad cyfredol

source: No tasks
cy: Dim tasgau

source: No themes
cy: Dim themâu

source: No converter
cy: Dim troswr

source: No reactions yet :( Add yours?
cy: Dim ymatebion eto :( Ychwanegu eich un chi?

source: None.
cy: Dim.

source: Dimension
cy: Dimensiwn

source: City
cy: Dinas

source: Default
cy: Diofyn

source: Security
cy: Diogelwch

source: Thank you
cy: Diolch

source: Thanks
cy: Diolch

source: thanks for playing
cy: diolch am chwarae

source: Thanks for using [APPNAME].
cy: Diolch am ddefnyddio [APPNAME].

source: Thanks for your tweets & emails.
cy: Diolch am eich negeseuon trydar ac e-byst.

source: Thanks for getting in touch!
cy: Diolch am gysylltu â ni!

source: Thank you for your time.
cy: Diolch i chi am eich amser.

source: Thank you for rating us
cy: Diolch i chi am roi sgôr i ni

source: Thank you all for your support of [APPNAME].
cy: Diolch i chi gyd am eich cefnogaeth i [APPNAME].

source: Thanks!
cy: Diolch!

source: Thank you! Please create your account By registering you are agreeing to the Terms and Conditions and Privacy Policy.
cy: Diolch! Crëwch eich cyfrif Trwy gofrestru rydych yn cytuno i'r Telerau ac Amodau a'r Polisi Preifatrwydd.

source: special thanks
cy: diolchiadau arbennig

source: Diplomacy
cy: Diplomyddiaeth

source: Mystery
cy: Dirgelwch

source: Vibration
cy: Dirgryniad

source: VIBRATION OFF
cy: DIRGRYNIAD I FFWRDD

source: VIBRATION ON
cy: DIRGRYNU YMLAEN

source: Saturation
cy: Dirlawnder

source: Brightness
cy: Disgleirdeb

source: Description
cy: Disgrifiad

source: App Store Description
cy: Disgrifiad y Siop Apiau

source: Describe your problem here…
cy: Disgrifiwch eich problem yma…

source: Replace data
cy: Disodli data

source: Replace data?
cy: Disodli data?

source: Overwrite Events
cy: Disodli Digwyddiadau

source: Replace with 'Completion Date'
cy: Disodli gyda 'Dyddiad cwblhau'

source: Replace Cloud data with Local data
cy: Disodli'r data cwmwl gyda data lleol

source: Replace Database
cy: Disodli'r Gronfa Ddata

source: End
cy: Diwedd

source: Line end
cy: Diwedd llinell

source: Recent
cy: Diweddar

source: Latest
cy: Diweddaraf

source: Update Available
cy: Diweddariad ar gael

source: Update
cy: Diweddaru

source: Updating Location
cy: Diweddaru'r lleoliad

source: Updated at %@
cy: Diweddarwyd am %@

source: Last updated
cy: Diweddarwyd ddiwethaf

source: Caption updated
cy: Diweddarwyd y capsiwn

source: Profile updated
cy: Diweddarwyd y proffil

source: Filter Updated
cy: Diweddarwyd yr hidlydd

source: WIFI
cy: DIWIFR

source: Day
cy: Diwrnod

source: Next Day
cy: Diwrnod canlynol

source: Game Days
cy: Diwrnod Gêm

source: Display day
cy: Diwrnod i'w dangos

source: Next Scheduled Day
cy: Diwrnod nesaf ar yr amserlen

source: Partial Day
cy: Diwrnod rhannol

source: Days
cy: Diwrnodau

source: Normal days
cy: Diwrnodau arferol

source: Off Days
cy: Diwrnodau i Ffwrdd

source: Specific days of the week
cy: Diwrnodau penodol o'r wythnos

source: Discard
cy: Diystyru

source: Dismiss
cy: Diystyru

source: Override
cy: Diystyru

source: Know the traffic conditions at a glance
cy: Dod i wybod am yr amodau traffig yn sydyn

source: Find People
cy: Dod o hyd i Bobl

source: FIND PEOPLE VIA FACEBOOK
cy: DOD O HYD I BOBL AR FACEBOOK

source: Find people to follow by searching your contacts
cy: Dod o hyd i bobl i ddilyn gan chwilio drwy eich cysylltiadau

source: Find people to follow by connecting Facebook
cy: Dod o hyd i bobl i ddilyn gan gysylltu â Facebook

source: Find people to follow by connecting Twitter
cy: Dod o hyd i bobl i ddilyn gan gysylltu â Twitter

source: FIND PEOPLE FROM YOUR CONTACTS
cy: DOD O HYD I BOBL O'CH CYSYLLTIADAU

source: Find Friends
cy: Dod o hyd i ffrindiau

source: Find friends from
cy: Dod o hyd i ffrindiau o

source: Find some friends!
cy: Dod o hyd i ffrindiau!

source: Find more Friends
cy: Dod o hyd i fwy o ffrindiau

source: Find my friends
cy: Dod o hyd i fy ffrindiau

source: Find another course
cy: Dod o hyd i gwrs arall

source: Find similar products in the Product details.
cy: Dod o hyd i gynnyrch tebyg ym manylion y cynnyrch.

source: Finding Location…
cy: Dod o hyd i leoliad…

source: Find Locations
cy: Dod o hyd i leoliadau

source: Find someone
cy: Dod o hyd i rywun

source: Find Replacement
cy: Dod o hyd i rywun arall

source: Find one now
cy: Dod o hyd i un nawr

source: Find your Friends
cy: Dod o hyd i'ch ffrindiau

source: Find Your Friends on [APPNAME]
cy: Dod o hyd i'ch ffrindiau ar [APPNAME]

source: Find your friends at the explore page
cy: Dod o hyd i'ch ffrindiau ar y dudalen archwilio

source: The video could not be saved.
cy: Doedd dim modd cadw'r fideo.

source: There is no need to enter your payment or delivery details again.
cy: Does dim angen nodi'ch manylion talu neu anfon eto.

source: There are no requests right now.
cy: Does dim ceisiadau ar hyn o bryd.

source: There are no other current requests available.
cy: Does dim ceisiadau cyfredol eraill ar gael.

source: There are no requests needing your action.
cy: Does dim ceisiadau sydd angen eich sylw.

source: There are no contacts available.
cy: Does dim cysylltiadau ar gael.

source: Unable to play video
cy: Does dim modd chwarae'r fideo

source: Unable to create the user. Please try again.
cy: Does dim modd creu'r defnyddiwr. Rhowch gynnig arall arni.

source: Unable to record video on %s
cy: Does dim modd recordio fideo ar %s

source: There is no more space left on your device.
cy: Does oes dim mwy o le ar ôl ar eich dyfais.

source: Doc
cy: Dog

source: Documentary
cy: Dogfen

source: Documentation
cy: Dogfennaeth

source: Documents
cy: Dogfennau

source: Insurance Documents
cy: Dogfennau yswiriant

source: Rotation Handle
cy: Dolen cylchdroi

source: Offset Handles
cy: Dolenni cilosod

source: Rotation Handles
cy: Dolenni cylchdroi

source: Rotation Center Handles
cy: Dolenni cylchdroi canolog

source: Draft
cy: Drafft

source: Dragon
cy: Draig

source: Drachms
cy: Dramau

source: Drams
cy: Dramau

source: Dragons
cy: Dreigiau

source: Mirror photo
cy: Drych lun

source: UK
cy: DU

source: Duke
cy: Dug

source: Duchess
cy: Duges

source: Simple, easy to use time tracking for your iPhone, iPod touch or iPad.
cy: Dull syml, hawdd i'w ddefnyddio o olrhain amser ar gyfer eich iPhone, iPod touch neu iPad.

source: double
cy: dwbl

source: Tell a Friend
cy: Dweud wrth ffrind

source: Tell Friends About [APPNAME]
cy: Dweud wrth ffrindiau am [APPNAME]

source: Count me in
cy: Dwi eisiau bod yn rhan

source: Include me
cy: Dwi eisiau cymryd rhan

source: Bring All to Front
cy: Dwyn popeth i'r blaen

source: Your Score
cy: Dy Sgôr

source: Duplicate Task and Subtasks
cy: Dyblygu tasgau ac is-dasgau

source: REVERT
cy: DYCHWELYD

source: Revert to Saved
cy: Dychwelyd at y ffeil a gadwyd

source: Friday
cy: Dydd Gwener

source: Thursday
cy: Dydd Iau

source: Monday
cy: Dydd Llun

source: Tuesday
cy: Dydd Mawrth

source: Wednesday
cy: Dydd Mercher

source: Saturday
cy: Dydd Sadwrn

source: Sunday
cy: Dydd Sul

source: Date
cy: Dyddiad

source: Date & Time
cy: Dyddiad ac Amser

source: Date and Time
cy: Dyddiad ac amser

source: Completion Date
cy: Dyddiad cwblhau

source: Due Date
cy: Dyddiad cwblhau yn erbyn

source: Start date
cy: Dyddiad cychwyn

source: Date start - end
cy: Dyddiad cychwyn - gorffen

source: Arrival date
cy: Dyddiad cyrraedd

source: optional date
cy: dyddiad dewisol

source: Departure date
cy: Dyddiad gadael

source: Birthdate
cy: Dyddiad geni

source: End date
cy: Dyddiad gorffen

source: optional reminder date
cy: dyddiad y nodyn atgoffa dewisol

source: Date is invalid
cy: Dyddiad yn annilys

source: Date: %@
cy: Dyddiad: %@

source: Weekdays
cy: Dyddiau'r wythnos

source: daily
cy: dyddiol

source: Work Log Book
cy: Dyddlyfr Gwaith

source: This username is unavailable.
cy: Dydy'r enw defnyddiwr hwn ddim ar gael.

source: You haven't recorded any time for %@.
cy: Dydych chi heb gofnodi unrhyw amser ar gyfer %@.

source: You haven’t recorded any time today, would you like to start?
cy: Dydych chi heb gofnodi unrhyw amser heddiw, hoffech chi gychwyn?

source: Future
cy: Dyfodol

source: End time should be after start time
cy: Dylai'r amser gorffen fod ar ôl yr amser cychwyn

source: You should be autheticated to do that
cy: Dylech fod wedi'i awdurdodi i wneud hynny

source: You should add your Twitter account in the device's settings first
cy: Dylech ychwanegu'ch cyfrif Twitter yng ngosodiadau'ch dyfais yn gyntaf

source: Duties
cy: Dyletswyddau

source: Designs
cy: Dyluniadau

source: Design
cy: Dylunio

source: Designed for iPhone, iPod touch and iPad.
cy: Dyluniwyd ar gyfer iPhone, iPod touch ac iPad.

source: designed by
cy: dyluniwyd gan

source: A Few %s To Start With
cy: Dyma rhai %s i gychwyn

source: Here are some awesome users to follow!
cy: Dyma rhai defnyddwyr anhygoel i'w dilyn!

source: These are our most commonly asked questions.
cy: Dyma'n cwestiynau mwyaf cyffredin.

source: Best Wishes
cy: Dymuniadau Gorau

source: Happy travels
cy: Dymunwn daith dda i chi

source: That’s it!
cy: Dyna'r cwbl!

source: Learn
cy: Dysgu

source: Learn More
cy: Dysgu mwy

source: Learn the basics
cy: Dysgu'r hanfodion

source: Please tell us what would make you love [APPNAME].
cy: Dywedwch wrthym beth fyddai'n gwneud i chi hoffi [APPNAME].

source: E-Mail
cy: E-bost

source: Email
cy: E-bost

source: e-mail to
cy: e-bost at

source: CSV email from
cy: E-bost CSV gan

source: New email
cy: E-bost newydd

source: Email bug reporting
cy: E-bostio i roi gwybod am chwilen

source: Email this backup
cy: E-bostio'r copi wrth gefn hwn

source: Email current settings to support
cy: E-bostio'r gosodiadau cyfredol i'r tîm cymorth

source: Email Us Your Feedback
cy: E-bostiwch eich adborth atom

source: Email or Username
cy: Ebost neu Enw defnyddiwr

source: Email/Username:
cy: Ebost/Enw defnyddiwr:

source: April
cy: Ebrill

source: see this
cy: edrychwch ar hwn

source: Maybe later
cy: Efallai yn ddiweddarach

source: Sound effects
cy: Effeithiau sain

source: New York, USA
cy: Efrog Newydd, UDA

source: Expand
cy: Ehangu

source: Enter Manually
cy: Ei nodi eich hun

source: Your Schedule
cy: Eich amserlen

source: Your email address
cy: Eich cyfeiriad ebost

source: Your last name
cy: Eich cyfenw

source: Your account
cy: Eich cyfrif

source: Your account: Free (subscribe)
cy: Eich cyfrif: Am ddim (tanysgrifio)

source: Your account: Premium (unsubscribe)
cy: Eich cyfrif: Premiwm (dad-danysgrifio)

source: Your password
cy: Eich cyfrinair

source: Your current password
cy: Eich cyfrinair cyfredol

source: Your new password
cy: Eich cyfrinair newydd

source: Your digital content
cy: Eich cynnwys digidol

source: your personal data.
cy: eich data personol.

source: Your email
cy: Eich e-bost

source: Your email or username
cy: Eich ebost neu enw defnyddiwr

source: Your name
cy: Eich enw

source: your cloud name
cy: eich enw cwmwl

source: Your first name
cy: Eich enw cyntaf

source: Your user name
cy: Eich enw defnyddiwr

source: Your username
cy: Eich enw defnyddiwr

source: Your friends
cy: Eich ffrindiau

source: Your country
cy: Eich gwlad

source: ALL CONTACTS
cy: EICH HOLL GYSYLLTIADAU

source: Manually
cy: Eich hun

source: Your location
cy: Eich lleoliad

source: Your current location is %@. Click here to change it.
cy: Eich lleoliad presennol yw %@. Cliciwch yma i'w newid.

source: Your Input
cy: Eich Mewnbwn

source: Your score
cy: Eich sgôr

source: YOUR NEXT SHIFT
cy: EICH SIFFT NESAF

source: Your optional comment here…
cy: Eich sylwadau dewisol yma…

source: icon
cy: eicon

source: App Icon
cy: Eicon yr ap

source: Our community
cy: Ein cymuned

source: Want more?
cy: Eisiau mwy?

source: Want to add a note? Add it here…
cy: Eisiau ychwanegu nodyn? Ychwanegwch un yma…

source: Already have an account?
cy: Eisoes â chyfrif?

source: Have an Account? Log In
cy: Eisoes â chyfrif? Mewngofnodwch

source: Already a user? Sign in.
cy: Eisoes yn ddefnyddiwr? Mewngofnodwch.

source: Item
cy: Eitem

source: Toolbar Item
cy: Eitem y bar offer

source: Wishlist item on Sale
cy: Eitemau ar y rhestr dymuniadau yn y sêl

source: Find your friends
cy: Eithaf gwag yma, nag yw hi?

source: Exclude
cy: Eithrio

source: Demo
cy: Enghraifft

source: Earned
cy: Enillwyd

source: Winner
cy: Enillydd

source: Earn
cy: Ennill

source: Name
cy: Enw

source: name and icon
cy: enw ac eicon

source: Invalid name
cy: Enw annilys

source: Name missing
cy: Enw ar goll

source: Display name
cy: Enw arddangos

source: First Name
cy: Enw Cyntaf

source: Username
cy: Enw defnyddiwr

source: Username or email
cy: Enw defnyddiwr neu e-bost

source: Incorrect username or password!
cy: Enw defnyddiwr neu gyfrinair anghywir!

source: Invalid username or password
cy: Enw defnyddiwr neu gyfrinair annilys

source: Username:
cy: Enw defnyddiwr:

source: Location name
cy: Enw'r lleoliad

source: Project name
cy: Enw'r prosiect

source: Project name is empty
cy: Enw'r prosiect yn wag

source: Names
cy: Enwau

source: In order to search your contacts for friends, we need access to your Contacts. Please grant access in the Settings app to continue.
cy: Er mwyn chwilio yn eich cysylltiadau am ffrindiau, rydym angen mynediad at eich Cysylltiadau. Gofynnir ichi ganiatáu mynediad yn ap lleoliadau i barhau.

source: In order to find posts nearby you, we need access to the GPS
cy: Er mwyn dod o hyd i bostiadau sydd gerllaw, rydym angen mynediad at y GPS

source: In order to find your friends, we need to send your contacts information to our servers using a secure connection.
cy: Er mwyn dod o hyd i'ch ffrindiau, mae angen i ni anfon gwybodaeth am eich cysylltiadau at ein gweinyddion drwy gysylltiad diogel.

source: others
cy: eraill

source: Due
cy: Erbyn

source: due %@
cy: erbyn %@

source: All time
cy: Erioed

source: All-time
cy: Erioed

source: Explain
cy: Esboniwch

source: Please explain the problem you want help with:
cy: Esboniwch y broblem rydych eisiau help gyda:

source: Briefly explain what happened
cy: Esboniwch yn gryno beth ddigwyddodd

source: Walkthrough
cy: Esiampl

source: Go to iCloud
cy: Ewch i iCloud

source: Go to settings
cy: Ewch i'r gosodiadau

source: Proceed to shop
cy: Ewch i'r siop

source: Go Now!
cy: Ewch nawr!

source: How Many
cy: Faint

source: How long did it take?
cy: Faint o amser gymerodd hi?

source: Version
cy: Fersiwn

source: Version %@
cy: Fersiwn %@

source: Version %1$@ (%2$@)
cy: Fersiwn %1$@ (%2$@)

source: App Version
cy: Fersiwn yr ap

source: Version:
cy: Fersiwn:

source: Version: %@
cy: Fersiwn: %@

source: Version: %s
cy: Fersiwn: %s

source: Vertical
cy: Fertigol

source: per hour
cy: fesul awr

source: Fax
cy: Ffacs

source: Favorite
cy: Ffefryn

source: Favorites
cy: Ffefrynnau

source: File
cy: Ffeil

source: A cookie is a small file of letters and numbers that we put on your computer.
cy: Ffeil fach o lythrennau a rhifau rydym yn ei roi ar eich cyfrifiadur yw cwci.

source: Window
cy: Ffenestr

source: Movie
cy: Ffilm

source: MOVIES
cy: FFILMIAU

source: Recommended Movies
cy: Ffilmiau a Argymhellir

source: Previously Watched Movies & Series
cy: Ffilmiau a Chyfresi a Wyliwyd o'r blaen

source: Previously Watched Movies
cy: Ffilmiau a Wyliwyd o'r Blaen

source: Recently Added Movies
cy: Ffilmiau a Ychwanegwyd yn Ddiweddar

source: CLASSIC MOVIES
cy: FFILMIAU CLASUROL

source: Family Movies
cy: Ffilmiau i'r Teulu

source: Movies In
cy: Ffilmiau Newydd

source: Film Noir
cy: Ffilmiau Noir

source: Fit
cy: Ffitio

source: Flip Vertical
cy: Fflipio'n fertigol

source: Flip Horizontal
cy: Fflipio'n llorweddol

source: Flip Camera
cy: Fflipio'r Camera

source: Focus
cy: Ffocws

source: Dropbox folder
cy: Ffolder Dropbox

source: Phone
cy: Ffôn

source: Place Phone Call
cy: Ffonio

source: Call Me
cy: Ffoniwch Fi

source: Font
cy: Ffont

source: Lifestyle
cy: Ffordd o fyw

source: A great way to show your support for software that you use.
cy: Ffordd wych o ddangos eich cefnogaeth ar gyfer y feddalwedd rydych chi'n ei ddefnyddio.

source: Forfeit
cy: Fforffedu

source: Forfeited
cy: Fforffedwyd

source: Time end format is invalid
cy: Fformar yr amser gorffen yn annilys

source: Time format
cy: Fformat amser

source: Incorrect phone format
cy: Fformat ffôn anghywir

source: Invalid import format or file
cy: Fformat mewngludo neu ffeil annilys

source: Decimal or standard hh:mm hours format
cy: Fformat oriau degol neu safonol hh:mm

source: Date format
cy: Fformat y dyddiad

source: Export date format
cy: Fformat y dyddiad allgludo

source: Date format is invalid
cy: Fformat y dyddiad yn annilys

source: Number Format
cy: Fformat y rhifau

source: Time start format is invalid
cy: Fformat yr amser cychwyn yn annilys

source: Friend
cy: Ffrind

source: Friends
cy: Ffrindiau

source: [USERNAME]'s friends
cy: Ffrindiau [USERNAME]

source: %s's friends
cy: ffrindiau %s

source: Selected Friends
cy: Ffrindiau a ddewiswyd

source: Friends on Frontback
cy: Ffrindiau ar Frontback

source: FRIENDS ON [APPNAME]
cy: FFRINDIAU AR KIK VIDEO

source: Facebook friends on [APPNAME]
cy: Ffrindiau Facebook ar [APPNAME]

source: Friends following you
cy: Ffrindiau sy'n eich dilyn

source: Activity Feed
cy: Ffrwd gweithgaredd

source: Live Streams
cy: Ffrydiau Byw

source: Sci-Fi
cy: Ffuglen wyddonol

source: Address form
cy: Ffurflen cyfeiriad

source: Advanced Configuration
cy: Ffurfweddiad uwch

source: Configure subscribers
cy: Ffurfweddu tanysgrifwyr

source: Configure the app for your business by tapping the cog icon in the top right corner.
cy: Ffurfweddwch yr ap ar gyfer eich busnes trwy daro'r eicon cocsen yn y gornel dde uchaf.

source: Source
cy: Ffynhonnell

source: Export Source
cy: Ffynhonnell allgludo

source: Photo source
cy: Ffynhonnell lluniau

source: Document source
cy: Ffynhonnell y ddogfen

source: Prosperity
cy: Ffyniant

source: Me
cy: Fi

source: Me, now.
cy: Fi, nawr.

source: Video
cy: Fideo

source: Video not available !
cy: Fideo ddim ar gael !

source: Getting Started Video
cy: Fideo i Ddechrau Arni

source: Videos
cy: Fideos

source: Videos Exported
cy: Fideos a allgludwyd

source: Recommended Videos
cy: Fideos a Argymhellir

source: Previously Watched Videos
cy: Fideos a Wyliwyd o'r Blaen

source: Music Videos
cy: Fideos Cerddoriaeth

source: Popular Music Videos
cy: Fideos Cerddoriaeth Poblogaidd

source: Videos Friends Shared
cy: Fideos ffryndiau wedi rhannu

source: Video from %s
cy: Fideos oddi wrth %s

source: Popular Videos
cy: Fideos Poblogaidd

source: Currently popular videos
cy: Fideos sy'n boblogaidd nawr

source: Tutorial Videos
cy: Fideos Tiwtorial

source: YouTube videos
cy: Fideos YouTube

source: Electron Volts
cy: Foltiau Electron

source: My Feed
cy: Fy Ffrwd

source: My Videos
cy: Fy Fideos

source: My Filters
cy: Fy hidlyddion

source: My travel profile
cy: Fy mhroffil teithio

source: My bank cards
cy: Fy nghardiau banc

source: My Activity
cy: Fy ngweithgaredd

source: My Active Rentals
cy: Fy Rhaglenni Cyfredol

source: MY CHANNELS
cy: FY SIANELI

source: My Other Job
cy: Fy swydd arall

source: My Other Jobs
cy: Fy swyddi eraill

source: LEAVE
cy: GADAEL

source: Leave [APPNAME]
cy: Gadael [APPNAME]

source: Leave [APPNAME]?
cy: Gadael [APPNAME]?

source: Leave Us A Review
cy: Gadael adolygiad ohonom

source: Leave maps on iCloud
cy: Gadael mapiau ar iCloud

source: Leave Memrise Premium
cy: Gadael Memrise Premium

source: Leave Game?
cy: Gadael y gêm?

source: Leave group
cy: Gadael y grŵp

source: Leave Chat
cy: Gadael y sgwrs

source: Quit?
cy: gadael?

source: Quit [APPNAME] Pro, then relaunch.
cy: Gadewch [APPNAME] Pro, yna ail-lansio.

source: Leave a tip to unlock house rules!
cy: Gadewch awgrym i ddatgloi'r rheolau tŷ!

source: Please leave your feedback
cy: Gadewch eich adborth

source: Lets Play
cy: Gadewch i ni chwarae

source: Let’s Get Started
cy: Gadewch i ni gychwyn arni

source: Let's get into it:
cy: Gadewch i ni gychwyn arni:

source: Let's Add Your Employees
cy: Gadewch i ni ychwanegu eich gweithwyr
